
// 'number' + 3 маємо вираз із стрінги та числа з +, який конкатенує стрінгу з числом що в результаті дає 'number3'
// 'number3' + 3 тут та сама дія, а отже в результаті маємо 'number33' 
console.log('number' + 3 + 3);

// null при використанні в математичній дії перетворюється на 0
// 0 + 3 = 3
console.log(null + 3);


// 5 перше значення і воно true і друге значення також true отже результат "qwerty"
console.log(5 && "qwerty");

// унарний плюс перед стрінгою перетворює +'40' в число 40, та +'2' в число 2
// 40 + 2 = 42 отже маємо простий математичний вираз  з результатом 42
// 42 + "hillel" = "42hillel" стрінга +число перетворюються на стрінгу. 
console.log(+'40' + +'2' + "hillel");

// '10'- 5  у цьому виразі '10' перетворюється на число бо JS бачить математичну операцію 
// 10 - 5 = 5  на виході маємо математичний вираз
// 5 === 6 дає в результаті false бо ці два числа не дорівнюють один одному
console.log('10' - 5 === 6);

// true дорівнює 1, false дорівнює 0
// 1 + 0 = 1 на виході маємо математичний вираз
console.log(true + false);

// '4px' не можна перетворити у число тож отримуємо NaN
//  будь яка дія з NaN в результаті дає NaN
console.log('4px' - 3);

// '4' - перетворюється на число бо JS бачить математичну операцію
// 4 - 3 = 1 маємо математичний вираз і результат 1 на виході.
console.log('4' - 3);

// 3 ** 0 це вираз який возводить 3 в нульову ступінь що від будь якого числа дорівнює 1
// возведення в ступін завжди робиться першою дією
// '6' + 1 маємо в результаті 61 тому що знак плюс конкатенує стрінгу з числом
console.log('6' + 3 ** 0);

// '6' перетворюється на 6 бо маємо математичну операцію
// 12 / 6 = 2 
console.log(12 / '6');

// 5 === 6 отримуємо  false тому ще 5 не дорівню 6
// '10' + false конкатенуємо стрінгу та бульове значення і оримуємо '10false'
console.log('10' + (5 === 6));

// null == '' на виході маємо false бо різні типи даних
console.log(null == '');


// 9 / 3 = 3 виконуємо першою математичну операцію бо вона в скобках
// 3 **3 = 27 потім возводимо 3 в 3 ступінь
console.log(3 ** (9 / 3));

// 'false' пертворюється в true бо два знаки оклику перетворюють будь яке не порожнє значення в true
// 'true' також перетворюється true
// true == true у результаті маємо true бо два однакових значення дорівнюють один одному
console.log(!!'false' == !!'true');

// '0' && 1 обидва значення true одже повертається останнє 1
// 0 || 1 повертає 1 бо дві риски повертають перше правдиве значення а 0 дорівнює false
console.log(0 || '0' && 1);

// +null знак + перетворюэ null в число 0 
// 0 == false дорівнює true тому що false це 0
// true дорівнює 1
// 1 < 1 дає false тому ще вони доівнюють одна одній
console.log((+null == false) < 1);

// false && true повертає false якщо обидва значення не є true
// false || true отримуємо true тому що дві риски повертають перше правдиве значення
console.log(false && true || true);

// false || true дорівню  true бо це перше правдиве значення
// false && true дорівнює false
console.log(false && (false || true));

// +null пертворюється на число 0; 
// 0 == false дорівнює true
// 1 ** 5 возводимо в ступінь і отримуємо 1
// true < 1 в результаті маємо false бо true сприймається за одиницю
console.log((+null == false) < 1 ** 5);