
function checkProbabilityTheory(count) { // оголошуємо функцію
  let even = 0; // створюємо змінну для парних
  let odd = 0;  // створюємо змінну для непарних
  let i = 0;    // створюємо лічильник циклів

  while (i < count) { // створюємо цикл
    let number = Math.floor(Math.random() * 901) + 100; // генеруємо рандомне число

    if (number % 2 === 0) { // створюємо перевірку для парних чисел, якщо залишок від ділення на 2=0 то число парне
      even = even + 1; 
    } else {
      odd = odd + 1;  // перевірка на непарне число за тією ж логікою що і парне перевіряли
    }

    i = i + 1;  // задаємо параметр щоб цикл закінчився досягнувши мети
    }

  let evenPercent = even / count * 100;  // рахуємо скільки відсотків парних чисел сгенерувалось
  let oddPercent = odd / count * 100;  // рахуємо скільки відсотків сгенерувалось непарних чисел 

 
  console.log("Загальна кількість чисел: " + count); //вивиодимо результати
  console.log("Парних: " + even);
  console.log("Непарних: " + odd);
  console.log("Відсоток парних: " + evenPercent + "%");
  console.log("Відсоток непарних: " + oddPercent + "%");

  }

  checkProbabilityTheory(45);// викликаємо функцію